Autodesk.Revit.DB.Events.DocumentClosingEventArgs.DocumentId
Id of the document that is about to be closed.
Remarks:
This Id is only used to identify the document for the duration of this event and the DocumentClosed event which follows. It serves as synchronization means for the pair of events.
Since:
2010

Autodesk.Revit.DB.Events.DocumentClosingEventArgs
The event arguments used by the DocumentClosing event.
Since:
2010